---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures
source: html/48092d19-da03-94bb-e096-7509d7075a05.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BeamSystemFailures

Failures about BeamSystem.

## Syntax (C#)
```csharp
public static class BeamSystemFailures
```